In [26]:
import numpy as np

In [27]:
import pandas as pd

In [28]:
from pandas import Series, DataFrame

In [29]:
obj = Series([-4,9,7,3])

In [3]:
obj

0   -4
1    9
2    7
3    3
dtype: int64

In [4]:
obj.values

array([-4,  9,  7,  3], dtype=int64)

In [5]:
obj.index()

TypeError: 'RangeIndex' object is not callable

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([-4,9,7,3],index=['a','b','c','d'])

In [8]:
obj2

a   -4
b    9
c    7
d    3
dtype: int64

In [9]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
obj['0']

KeyError: '0'

In [11]:
obj[0

SyntaxError: unexpected EOF while parsing (<ipython-input-11-7e03136fc782>, line 1)

In [12]:
obj[0]

-4

In [13]:
obj2[0]

-4

In [14]:
obj['b']

KeyError: 'b'

In [15]:
obj2['b']

9

In [16]:
obj2['a','c']

KeyError: ('a', 'c')

In [17]:
obj2[['b','c']]

b    9
c    7
dtype: int64

In [18]:
obj2[['d','c']]

d    3
c    7
dtype: int64

In [19]:
obj[obj2>0]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [20]:
obj2[obj>0]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [21]:
obj2

a   -4
b    9
c    7
d    3
dtype: int64

In [22]:
obj2[obj2 > 0]

b    9
c    7
d    3
dtype: int64

In [23]:
obj2*2

a    -8
b    18
c    14
d     6
dtype: int64

In [24]:
obj2.exp()

AttributeError: 'Series' object has no attribute 'exp'

In [30]:
np.exp(obj2)

a       0.018316
b    8103.083928
c    1096.633158
d      20.085537
dtype: float64

In [31]:
'b' in obj2

True

In [32]:
-4 in obj2

False

In [33]:
sdic{'a':1,'b':2,'c':3,'d':4}

SyntaxError: invalid syntax (<ipython-input-33-f2e41c661ef1>, line 1)

In [34]:
sdic={'a':1,'b':2,'c':3,'d':4}

In [35]:
sdic

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [36]:
obj3=pd.Series(sdic)

In [37]:
obj3

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
ss = ['aa','bb','cc','dd']

In [39]:
ss

['aa', 'bb', 'cc', 'dd']

In [40]:
obj4=pd.Series(sdic,index=ss)

In [41]:
obj4

aa   NaN
bb   NaN
cc   NaN
dd   NaN
dtype: float64

In [42]:
sidc

NameError: name 'sidc' is not defined

In [43]:
sdic

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [47]:
ss = ['b','d','c','e']

In [48]:
obj4=pd.Series(sdic,index=ss)

In [60]:
obj4

b    2.0
d    4.0
c    3.0
e    NaN
Name: poldaafa, dtype: float64

In [50]:
pd.isnull(obj4)

b    False
d    False
c    False
e     True
dtype: bool

In [51]:
obj.isnull()

0    False
1    False
2    False
3    False
dtype: bool

In [52]:
obj4.isnull()

b    False
d    False
c    False
e     True
dtype: bool

In [53]:
obj.notnull()

0    True
1    True
2    True
3    True
dtype: bool

In [54]:
obj4.notnull()

b     True
d     True
c     True
e    False
dtype: bool

In [55]:
obj3

a    1
b    2
c    3
d    4
dtype: int64

In [56]:
obj4

b    2.0
d    4.0
c    3.0
e    NaN
dtype: float64

In [57]:
obj3+bj4

NameError: name 'bj4' is not defined

In [58]:
obj3+obj4

a    NaN
b    4.0
c    6.0
d    8.0
e    NaN
dtype: float64

In [59]:
obj4.name='poldaafa'

In [61]:
obj4.index.name='ss'

In [62]:
obj4

ss
b    2.0
d    4.0
c    3.0
e    NaN
Name: poldaafa, dtype: float64

In [63]:
obj4.index=['11','22','33','44']

In [64]:
obj4

11    2.0
22    4.0
33    3.0
44    NaN
Name: poldaafa, dtype: float64

In [65]:
data = {'state':['ohio','ohio','ohio','Nevada','Nevada','Nevada',],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [66]:
frame = pd.DataFrame(data)

In [67]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [68]:
farame.name='abcdefg'

NameError: name 'farame' is not defined

In [69]:
frame.name='abcd'

In [70]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [71]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [73]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [75]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['a','b','c','d','e','f'])

In [76]:
frame2

   year   state  pop debt
a  2000    ohio  1.5  NaN
b  2001    ohio  1.7  NaN
c  2002    ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN
f  2003  Nevada  3.2  NaN

In [77]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [78]:
frame2['pop']

a    1.5
b    1.7
c    3.6
d    2.4
e    2.9
f    3.2
Name: pop, dtype: float64

In [79]:
frame.pop

<bound method NDFrame.pop of     state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [80]:
frame2.pop

<bound method NDFrame.pop of    year   state  pop debt
a  2000    ohio  1.5  NaN
b  2001    ohio  1.7  NaN
c  2002    ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN
f  2003  Nevada  3.2  NaN>

In [81]:
frame2.year

a    2000
b    2001
c    2002
d    2001
e    2002
f    2003
Name: year, dtype: int64

In [82]:
frame2[aa]

NameError: name 'aa' is not defined

In [83]:
frame2['a']

KeyError: 'a'

In [84]:
frame2['0']

KeyError: '0'

In [85]:
frame2[0,1]

KeyError: (0, 1)

In [86]:
frame2[0:3]

   year state  pop debt
a  2000  ohio  1.5  NaN
b  2001  ohio  1.7  NaN
c  2002  ohio  3.6  NaN

In [87]:
frame2[0,1,2]

KeyError: (0, 1, 2)

In [88]:
frame2.loc['a']

year     2000
state    ohio
pop       1.5
debt      NaN
Name: a, dtype: object

In [89]:
frame2.loc[0]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [90]:
frame2[0]

KeyError: 0

In [91]:
frame2.iloc[0,:]

year     2000
state    ohio
pop       1.5
debt      NaN
Name: a, dtype: object

In [92]:
frame2.ix[[0,2],['pop','year']]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   pop  year
a  1.5  2000
c  3.6  2002

In [93]:
frame2

   year   state  pop debt
a  2000    ohio  1.5  NaN
b  2001    ohio  1.7  NaN
c  2002    ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN
f  2003  Nevada  3.2  NaN

In [94]:
frame2['debt']=16.5

In [95]:
frame2

   year   state  pop  debt
a  2000    ohio  1.5  16.5
b  2001    ohio  1.7  16.5
c  2002    ohio  3.6  16.5
d  2001  Nevada  2.4  16.5
e  2002  Nevada  2.9  16.5
f  2003  Nevada  3.2  16.5

In [96]:
frame2['debt']=range(6)

In [97]:
frame2

   year   state  pop  debt
a  2000    ohio  1.5     0
b  2001    ohio  1.7     1
c  2002    ohio  3.6     2
d  2001  Nevada  2.4     3
e  2002  Nevada  2.9     4
f  2003  Nevada  3.2     5

In [98]:
frame2['debt']=np.arange(6.)

In [99]:
frame2

   year   state  pop  debt
a  2000    ohio  1.5   0.0
b  2001    ohio  1.7   1.0
c  2002    ohio  3.6   2.0
d  2001  Nevada  2.4   3.0
e  2002  Nevada  2.9   4.0
f  2003  Nevada  3.2   5.0

In [100]:
val = pd.Series([-1.2,-1.5,-1.7],index=['a','d','e'])

In [101]:
frame2['debt']=val

In [102]:
frame2

   year   state  pop  debt
a  2000    ohio  1.5  -1.2
b  2001    ohio  1.7   NaN
c  2002    ohio  3.6   NaN
d  2001  Nevada  2.4  -1.5
e  2002  Nevada  2.9  -1.7
f  2003  Nevada  3.2   NaN

In [103]:
frame2.index=['one','two','three','four','five','six']

In [104]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  -1.2
two    2001    ohio  1.7   NaN
three  2002    ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [107]:
frame2.state

one        ohio
two        ohio
three      ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [118]:
frame2['eastern']=frame2.state=='ohio'

In [119]:
frame2

       year   state  pop  debt  estern  eastern
one    2000    ohio  1.5  -1.2    True     True
two    2001    ohio  1.7   NaN    True     True
three  2002    ohio  3.6   NaN    True     True
four   2001  Nevada  2.4  -1.5   False    False
five   2002  Nevada  2.9  -1.7   False    False
six    2003  Nevada  3.2   NaN   False    False

In [120]:
del frame2['eastern']

In [121]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'estern'], dtype='object')

In [122]:
frame2.columns=['year', 'state', 'pop', 'debt', 'estern']

In [123]:
del frame2['estern']

In [124]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  -1.2
two    2001    ohio  1.7   NaN
three  2002    ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [125]:
frame2.colunmns

AttributeError: 'DataFrame' object has no attribute 'colunmns'

In [126]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [127]:
frame.colums2=['year', 'state', 'pop', 'debtsss']

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [128]:
frame2.columns=['year', 'state', 'pop', 'debtsss']

In [129]:
frame2

       year   state  pop  debtsss
one    2000    ohio  1.5     -1.2
two    2001    ohio  1.7      NaN
three  2002    ohio  3.6      NaN
four   2001  Nevada  2.4     -1.5
five   2002  Nevada  2.9     -1.7
six    2003  Nevada  3.2      NaN

In [130]:
frame2.columns=['year', 'state', 'pop', 'debt']

In [137]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [132]:
frame3=pd.DataFrame(pop)

In [133]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [134]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [139]:
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [140]:
pdata={'Ohio':frame3['Ohio'][:-1],
      'Nevada':frame3['Nevada'][:2]}

In [141]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [142]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [143]:
farme3.columns

NameError: name 'farme3' is not defined

In [144]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [145]:
frame3.index.name='state'
frame3.columns.name='year'

In [146]:
frame3

year   Nevada  Ohio
state
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [148]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [149]:
frame2.values

array([[2000, 'ohio', 1.5, -1.2],
       [2001, 'ohio', 1.7, nan],
       [2002, 'ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [150]:
obj = pd.Series(range(3),index=['a','b','c'])

In [151]:
obj

a    0
b    1
c    2
dtype: int64

In [152]:
index = obj.index

In [153]:
index

Index(['a', 'b', 'c'], dtype='object')

In [154]:
index[1]

'b'

In [155]:
index[1]='dada'

TypeError: Index does not support mutable operations

In [156]:
iobj2=pd.Series([-1.5,-2.,0],index=index)

In [157]:
iobj2

a   -1.5
b   -2.0
c    0.0
dtype: float64

In [158]:
labels=pd.Index(range(3))

In [159]:
labels

RangeIndex(start=0, stop=3, step=1)

In [160]:
obj2=pd.DataFrame([-1.5,-2.,0],index=labels)

In [161]:
obj2

     0
0 -1.5
1 -2.0
2  0.0

In [162]:
obj2.index=labels

In [163]:
obj2.index is labels

True

In [164]:
frame3

year   Nevada  Ohio
state
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [165]:
'Ohio' in frame3.columns

True

In [166]:
2002 in frame3.index

True

In [167]:
####

In [168]:
# 
obj

a    0
b    1
c    2
dtype: int64

In [169]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [170]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [171]:
obj2=obj.reindex(['a','b','c','d','e'])

In [172]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [173]:
obj3=pd.Series(['bule','purple','yellow'],index=[0,2,4])

In [174]:
obj3

0      bule
2    purple
4    yellow
dtype: object

In [178]:
obj3.reindex(range(6),method='ffill')

0      bule
1      bule
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [179]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),
                  index=['a','c','d'],
                  columns=['Ohio,','Texas','California'])

In [180]:
frame

   Ohio,  Texas  California
a      0      1           2
c      3      4           5
d      6      7           8

In [181]:
frame2=frame.reindex(['a','b','c','d'])

In [182]:
frame2

   Ohio,  Texas  California
a    0.0    1.0         2.0
b    NaN    NaN         NaN
c    3.0    4.0         5.0
d    6.0    7.0         8.0

In [184]:
state=['Texas','Utah','California']
frame.reindex(columns=state)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [186]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [188]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [189]:
new_obj=obj.drop('c')

In [190]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [191]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [202]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                       index=['Ohio','colorado','Utah','NewYork'],

                   columns=['one','two','three','four'])

In [203]:
data

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [207]:
data.drop(['colorado','Ohio'])

         one  two  three  four
Utah       8    9     10    11
NewYork   12   13     14    15

In [208]:
data

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [210]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [211]:
data

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [212]:
data.drop('two',axis=1,inplace=True)

In [213]:
data

          one  three  four
Ohio        0      2     3
colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [215]:
data['two']=[1,5,9,12]

In [216]:
data

          one  three  four  two
Ohio        0      2     3    1
colorado    4      6     7    5
Utah        8     10    11    9
NewYork    12     14    15   12

In [217]:
del data['two']

In [218]:
data

          one  three  four
Ohio        0      2     3
colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [219]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                       index=['Ohio','colorado','Utah','NewYork'],

                   columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [220]:
data.loc[:'Utah','two']

Ohio        1
colorado    5
Utah        9
Name: two, dtype: int32

In [222]:
data.iloc[:,:3][data.three>5]

          one  two  three
colorado    4    5      6
Utah        8    9     10
NewYork    12   13     14

In [223]:
ser=pd.Series(np.arange(3.))

In [224]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [225]:
ser[1]

1.0

In [226]:
ser[-1]

KeyError: -1

In [227]:
ser[0:2]

0    0.0
1    1.0
dtype: float64

In [228]:
ser.loc[1]

1.0

In [229]:
df1=pd.DataFrame(np.arange(9).reshape(3,3),
                columns=list('bcd'),
                index=['Ohio','Texas','Colorado'])

In [230]:
df2=pd.DataFrame(np.arange(12).reshape(4,3),
                 columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [231]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [232]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [233]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [235]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [236]:
df1.add()??

SyntaxError: invalid syntax (<ipython-input-236-27f692a5cc0c>, line 1)

In [237]:
df.add()??

SyntaxError: invalid syntax (<ipython-input-237-8ba8cc516afb>, line 1)

In [238]:
DataFrame.add()??

SyntaxError: invalid syntax (<ipython-input-238-73dee3ae80b7>, line 1)

In [239]:
df*2

NameError: name 'df' is not defined

In [240]:
df1*2

           b   c   d
Ohio       0   2   4
Texas      6   8  10
Colorado  12  14  16

In [241]:
df

NameError: name 'df' is not defined

In [242]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [243]:
1/df1

                 b         c      d
Ohio           inf  1.000000  0.500
Texas     0.333333  0.250000  0.200
Colorado  0.166667  0.142857  0.125

In [244]:
df1.rdiv(1)

                 b         c      d
Ohio           inf  1.000000  0.500
Texas     0.333333  0.250000  0.200
Colorado  0.166667  0.142857  0.125

In [245]:
df1.div(2)

            b    c    d
Ohio      0.0  0.5  1.0
Texas     1.5  2.0  2.5
Colorado  3.0  3.5  4.0

In [246]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),
                 columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [247]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [248]:
series=frame.iloc[0]

In [250]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [251]:
frame-series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [253]:
series3=frame.loc[:,'d']

In [254]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [259]:
frame.sub(series3,axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [261]:
#### 
frame=pd.DataFrame(np.random.randn(4,3),
                 columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [262]:
frame

               b         d         e
Utah   -1.240921  0.504427 -0.626128
Ohio    1.025423 -1.908292  1.454560
Texas   0.005086 -1.351955  0.700113
Oregon  2.212362 -0.917209 -1.961634

In [263]:
np.abs(frame)

               b         d         e
Utah    1.240921  0.504427  0.626128
Ohio    1.025423  1.908292  1.454560
Texas   0.005086  1.351955  0.700113
Oregon  2.212362  0.917209  1.961634

In [264]:
f=lambda x: x.max()-x.min()

In [265]:
frame.apply(f)

b    3.453284
d    2.412718
e    3.416194
dtype: float64

In [267]:
frame.apply(f,axis=1)

Utah      1.745348
Ohio      3.362852
Texas     2.052067
Oregon    4.173997
dtype: float64

In [268]:
format1=lambda x:'%.2f'% x

In [269]:
frame.applymap(format1)

            b      d      e
Utah    -1.24   0.50  -0.63
Ohio     1.03  -1.91   1.45
Texas    0.01  -1.35   0.70
Oregon   2.21  -0.92  -1.96

In [272]:
frame.loc[:,'e'].map(format1)

Utah      -0.63
Ohio       1.45
Texas      0.70
Oregon    -1.96
Name: e, dtype: object

In [273]:
obj=pd.Series([7,-5,7,42,0,4])

In [274]:
obj.rank()

0    4.5
1    1.0
2    4.5
3    6.0
4    2.0
5    3.0
dtype: float64

In [275]:
obj.rank(method='first')

0    4.0
1    1.0
2    5.0
3    6.0
4    2.0
5    3.0
dtype: float64

In [278]:
frame.sum()  ## huizng

b    2.001950
d   -3.673028
e   -0.433090
dtype: float64

In [279]:
frame.cumsum()

               b         d         e
Utah   -1.240921  0.504427 -0.626128
Ohio   -0.215498 -1.403865  0.828432
Texas  -0.210412 -2.755819  1.528545
Oregon  2.001950 -3.673028 -0.433090

In [280]:
frame.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean   0.500488 -0.918257 -0.108272
std    1.470148  1.031551  1.505441
min   -1.240921 -1.908292 -1.961634
25%   -0.306416 -1.491039 -0.960004
50%    0.515255 -1.134582  0.036992
75%    1.322158 -0.561800  0.888724
max    2.212362  0.504427  1.454560

In [283]:
obj=pd.Series(list('aacd'*4))

In [284]:
obj

0     a
1     a
2     c
3     d
4     a
5     a
6     c
7     d
8     a
9     a
10    c
11    d
12    a
13    a
14    c
15    d
dtype: object

In [285]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object